Here is a highly realistic and original resume for a senior candidate in the field of data visualization:

```
{
  "name": "Rahul Desai",
  "email": "rdesai@example.com",
  "phone": "415-123-4567",
  "linkedin": "https://www.linkedin.com/in/rdesai/",
  "summary": "Results-driven senior leader and data visualization expert with 10+ years of experience in driving business outcomes through interactive dashboards, storytelling, and strategic delivery. Proven track record of leading high-performing teams, designing innovative architectures, and mentoring junior team members.",
  "experience": [
    {
      "title": "Director, Data Visualization",
      "company": "Data Insights Corporation",
      "duration": "2018-Present",
      "details": [
        "Developed and led a team of 10 data visualization experts to deliver high-impact dashboards for Fortune 500 clients, resulting in a 25% increase in customer satisfaction.",
        "Designed and implemented a scalable architecture using Tableau and Power BI, enabling the delivery of 500+ dashboards across multiple industries.",
        "Collaborated with cross-functional teams to develop data-driven product roadmaps, driving business outcomes through data-informed decision making.",
        "Mentored junior team members in storytelling and visual analytics best practices, resulting in a 30% increase in team productivity.",
        "Developed and maintained relationships with key clients, ensuring high levels of satisfaction and repeat business.",
        "Identified and prioritized opportunities for process improvements, streamlining data visualization workflows by 20%."
      ]
    },
    {
      "title": "Senior Data Visualization Consultant",
      "company": "Nexus Analytics",
      "duration": "2015-2018",
      "details": [
        "Designed and developed interactive dashboards using D3.js and Plotly for a Fortune 100 client, resulting in a 15% increase in sales forecasting accuracy.",
        "Collaborated with business stakeholders to develop data-driven product roadmaps, driving business outcomes through data-informed decision making.",
        "Developed and maintained relationships with key clients, ensuring high levels of satisfaction and repeat business.",
        "Identified and prioritized opportunities for process improvements, streamlining data visualization workflows by 15%."
      ]
    },
    {
      "title": "Data Visualization Architect",
      "company": "Innovatech Solutions",
      "duration": "2010-2015",
      "details": [
        "Designed and implemented a scalable architecture using Tableau and Power BI for a Fortune 500 client, enabling the delivery of 200+ dashboards across multiple industries.",
        "Collaborated with cross-functional teams to develop data-driven product roadmaps, driving business outcomes through data-informed decision making.",
        "Mentored junior team members in storytelling and visual analytics best practices, resulting in a 25% increase in team productivity."
      ]
    }
  ],
  "education": {
    "degree": "Master of Science in Information Systems",
    "institution": "University of Illinois at Urbana-Champaign",
    "year": "2005"
  },
  "skills": [
    "Tableau", "Power BI", "D3.js", "Plotly", "Storytelling with visual analytics", "Leadership and team management", "Architecture design and implementation"
  ],
  "certifications": []
}
```

Please note that the above resume is fictional, but it highlights a senior candidate's skills and experience in data visualization, leadership, architecture, and strategic delivery.

