Here is a highly realistic and original resume for a mid candidate in the field of data analytics:

```json
{
  "name": "Rahul Chandra",
  "email": "rahulchandra@gmail.com",
  "phone": "+1 (212) 555-1234",
  "linkedin": "https://www.linkedin.com/in/rahulchandra/",
  "summary": "Results-driven data analytics professional with 3 years of experience in building and analyzing large-scale datasets, driving business insights, and delivering actionable recommendations. Proficient in exploratory data analysis, pandas, SQL, KPI dashboards, hypothesis testing, and stakeholder reporting.",
  "experience": [
    {
      "title": "Senior Data Analyst",
      "company": "ABC Corporation",
      "duration": "2020-2022",
      "details": [
        "Designed and developed end-to-end data pipelines using pandas, SQL, and Python to analyze customer behavior and preferences.",
        "Built and maintained complex KPI dashboards in Tableau to track key performance indicators and inform business decisions.",
        "Conducted exploratory data analysis to identify trends and patterns in large datasets, resulting in 15% improvement in sales forecasting accuracy.",
        "Collaborated with cross-functional teams to develop data-driven solutions, including market research reports and customer segmentation studies.",
        "Utilized statistical techniques, such as hypothesis testing and regression analysis, to inform marketing strategies and optimize campaign ROI.",
        "Presented findings and insights to senior leadership and stakeholders through interactive dashboards and actionable recommendations.",
        "Worked with IT team to integrate data sources, resolve data quality issues, and ensure data accuracy and integrity."
      ]
    },
    {
      "title": "Data Analyst",
      "company": "XYZ Inc.",
      "duration": "2018-2020",
      "details": [
        "Developed and maintained databases using MySQL and pandas to track customer interactions and sales trends.",
        "Created data visualizations and reports using Tableau to communicate insights and recommendations to stakeholders.",
        "Conducted A/B testing and experimentation to evaluate the effectiveness of marketing campaigns and optimize ROI.",
        "Worked with product team to analyze customer feedback and sentiment, resulting in 10% increase in product adoption."
      ]
    },
    {
      "title": "Data Science Intern",
      "company": "PQR Research Institute",
      "duration": "Summer 2019",
      "details": [
        "Assisted in the design and implementation of a machine learning model to predict customer churn, achieving an accuracy rate of 85%.",
        "Analyzed large datasets using pandas and SQL to identify trends and patterns in consumer behavior."
      ]
    }
  ],
  "education": {
    "degree": "Master of Science in Data Analytics",
    "institution": "University of New York",
    "year": "2018"
  },
  "skills": ["pandas", "SQL", "Tableau", "KPI dashboards", "Hypothesis testing", "Stakeholder reporting"],
  "certifications": []
}
```

Please note that this is a highly realistic and original resume, but the names, dates, and companies are fictional.

