Here is a highly realistic and original resume for a senior candidate in the field of big data:

```json
{
  "name": "Rohan Kumar",
  "email": "rohan.kumar@bigdataexperts.com",
  "phone": "+1 (555) 123-4567",
  "linkedin": "https://www.linkedin.com/in/rohankumar/",
  "summary": "Highly experienced big data leader with a strong track record of delivering large-scale, high-performance data processing solutions. Skilled in Spark, Hadoop, Hive, and Presto, with expertise in architecture design, strategic delivery, and cross-team collaboration.",
  "experience": [
    {
      "title": "Senior Big Data Architect",
      "company": "DataSphere Inc.",
      "duration": "2018 - Present (4 years)",
      "details": [
        "Designed and implemented a large-scale data processing pipeline using Spark, Hadoop, and Hive for a Fortune 500 client, resulting in a 3x increase in data processing speed and a 5x reduction in costs.",
        "Led a team of 5 engineers to develop a real-time streaming data processing system using Presto and Apache Kafka, which enabled our clients to respond to market trends in near-real-time.",
        "Collaborated with the engineering team to develop a high-performance data transformation framework using Spark SQL and Scala, resulting in a 20x increase in data processing speed for critical business applications.",
        "Mentored junior engineers and developed a training program to improve big data skills within the organization, resulting in a 30% increase in employee productivity.",
        "Worked closely with cross-functional teams to develop a comprehensive data governance strategy, ensuring compliance with regulatory requirements and improving data quality by 25%."
      ]
    },
    {
      "title": "Big Data Architect",
      "company": "Insight Inc.",
      "duration": "2015 - 2018 (3 years)",
      "details": [
        "Designed and implemented a big data platform using Hadoop, Hive, and Presto for a large-scale analytics project, resulting in a 10x increase in data processing speed and a 20% reduction in costs.",
        "Collaborated with the engineering team to develop a high-volume data transformation framework using Spark SQL and Scala, which enabled our clients to scale their big data workloads more efficiently.",
        "Worked closely with the product management team to develop a big data analytics platform for a Fortune 100 client, resulting in a 30% increase in sales forecasting accuracy."
      ]
    },
    {
      "title": "Senior Software Engineer",
      "company": "Tata Consultancy Services (TCS)",
      "duration": "2010 - 2015 (5 years)",
      "details": [
        "Designed and implemented several big data projects using Hadoop, Hive, and Pig for various clients, resulting in significant improvements in data processing speed and efficiency.",
        "Mentored junior engineers and developed a training program to improve big data skills within the organization."
      ]
    }
  ],
  "education": {
    "degree": "Master of Science (MS) in Computer Science",
    "institution": "Indian Institute of Technology (IIT) Delhi",
    "year": "2005 - 2007"
  },
  "skills": [
    "Spark",
    "Hadoop",
    "Hive",
    "Presto",
    "Apache Kafka",
    "Scala",
    "Java",
    "Python",
    "AWS Glue",
    "Azure Databricks"
  ],
  "certifications": []
}
```

Note: This is a highly realistic and original resume, but please keep in mind that the candidate's actual experience, skills, and accomplishments may vary.

