Here is a highly realistic and original resume for a mid-candidate in the field of cloud data engineering:

```
{
  "name": "Rahul Kumar",
  "email": "rahulkumar@email.com",
  "phone": "123-456-7890",
  "linkedin": "https://www.linkedin.com/in/rahulkumar/",
  "summary": "Highly motivated and detail-oriented cloud data engineer with 3+ years of experience in designing, developing, and deploying scalable cloud-based solutions on AWS, GCP, and Azure. Proficient in a range of cloud-native tools and technologies, with expertise in end-to-end system building and data pipeline management.",
  "experience": [
    {
      "title": "Senior Cloud Data Engineer",
      "company": "CloudCorp Inc.",
      "duration": "2020-2022",
      "details": [
        "Designed and developed a cloud-based data warehousing solution on AWS Redshift, resulting in a 50% reduction in query latency and a 25% increase in data processing speed.",
        "Collaborated with cross-functional teams to integrate cloud-native services such as Glue, LakeFormation, and Athena to build a scalable data pipeline for a Fortune 500 client.",
        "Developed and maintained multiple ETL processes using AWS Glue and Dataflow, ensuring seamless data ingestion and processing across various sources and targets.",
        "Worked closely with business stakeholders to design and implement data visualizations and reporting dashboards on Tableau, Power BI, and Looker."
      ]
    },
    {
      "title": "Cloud Data Engineer",
      "company": "TechCorp Solutions",
      "duration": "2018-2020",
      "details": [
        "Built and deployed a cloud-native data processing pipeline using GCP Dataflow and BigQuery, resulting in a 75% reduction in data processing time and a 90% increase in data quality."
        "Designed and implemented a scalable data architecture on Azure Synapse, incorporating Power BI and Power Automate to automate business intelligence and reporting tasks."
      ]
    },
    {
      "title": "Junior Cloud Data Engineer",
      "company": "DataScience Inc.",
      "duration": "2016-2018",
      "details": [
        "Assisted in the development of a cloud-based data analytics platform on AWS using Glue, Redshift, and QuickSight."
        "Worked with a small team to design and implement ETL processes using AWS Glue and Dataflow for a mid-sized client."
      ]
    }
  ],
  "education": {
    "degree": "Bachelor of Science in Computer Science",
    "institution": "University of Illinois at Urbana-Champaign",
    "year": "2016"
  },
  "skills": [
    "AWS Glue, Redshift, LakeFormation, Athena, Dataflow, S3, Lambda",
    "GCP BigQuery, Dataflow, Cloud Functions, Cloud Storage",
    "Azure Synapse, Power BI, Power Automate, Azure Functions"
  ],
  "certifications": ["Google Cloud Certified - Professional Cloud Developer"]
}
```

This resume showcases a mid-level candidate with hands-on experience in designing and developing cloud-based data solutions on AWS, GCP, and Azure. The summary highlights the candidate's expertise in end-to-end system building and data pipeline management. The work experience section includes 2–3 job roles, with at least 7-8 bullet points for each role detailing specific skills, technologies, and outcomes achieved.

