Here is a highly realistic and original resume for a senior candidate in the field of data analytics:

```
{
  "name": "Rohan Kumar",
  "email": "rohan.kumar@datawizard.com",
  "phone": "+1 (555) 123-4567",
  "linkedin": "https://www.linkedin.com/in/rohan-kumar-data-analyst/",
  "summary": "Results-driven data analytics leader with 10+ years of experience driving business growth through data-driven insights. Skilled in exploratory data analysis, pandas, SQL, and KPI dashboard development. Proven track record of building high-performing teams and collaborating cross-functionally to drive strategic delivery.",
  "experience": [
    {
      "title": "Senior Data Analytics Lead",
      "company": "ABC Corporation",
      "duration": "2018 - Present (3 years)",
      "details": [
        "Designed and implemented a data warehouse architecture using AWS Redshift, resulting in a 30% reduction in reporting cycle time.",
        "Built and led a team of 5 data analysts, providing mentorship and coaching to ensure project delivery excellence.",
        "Developed and maintained complex KPI dashboards using Tableau, providing real-time insights to senior leadership.",
        "Collaborated with cross-functional teams to develop and implement data-driven business strategies, resulting in a 25% increase in revenue growth."
      ]
    },
    {
      "title": "Data Analytics Architect",
      "company": "XYZ Inc.",
      "duration": "2015 - 2018 (3 years)",
      "details": [
        "Designed and implemented a data lake architecture using Hadoop and Spark, enabling real-time analytics capabilities.",
        "Developed and maintained complex ETL pipelines using Python and Apache Beam, resulting in a 40% reduction in data processing time.",
        "Collaborated with stakeholders to define KPIs and metrics, developing dashboards using Power BI to visualize key performance indicators."
      ]
    },
    {
      "title": "Data Analyst",
      "company": "PQR LLC",
      "duration": "2010 - 2015 (5 years)",
      "details": [
        "Conducted exploratory data analysis using pandas and NumPy, identifying trends and patterns in customer behavior.",
        "Developed SQL queries to extract insights from large datasets, resulting in a 20% increase in marketing campaign ROI."
      ]
    }
  ],
  "education": {
    "degree": "Master of Science in Data Analytics",
    "institution": "University of California, Berkeley",
    "year": "2010"
  },
  "skills": [
    "Pandas", "SQL", "Tableau", "Power BI", "Hadoop", "Spark", "Apache Beam", "Python"
  ],
  "certifications": []
}
```

I hope this meets your requirements! Let me know if you need any further assistance.

